Revit 2024 API
ParameterTypeId.AnalyticalModelBaseExtensionMethod Property
 "Base Extension Method"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelBaseExtensionMethod { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelBaseExtensionMethod As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelBaseExtensionMethod {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace